Tekla.Structures.Drawing.View.VerticalLabelPosition
The vertical label position types.

Tekla.Structures.Drawing.View.VerticalLabelPosition.Top
The label is located on the top of the view.

Tekla.Structures.Drawing.View.VerticalLabelPosition.Bottom
The label is located on the bottom of the view.